name: "openclip_image_encoder"
backend: "python"
max_batch_size: 0

input [
  {
    name: "image_encoder_input"
    data_type: TYPE_STRING
    dims: [1]
  }
]
output [
  {
    name: "image_encoder_output"
    data_type: TYPE_FP32
    dims: [768]
  }
]
