name: "openclip_text_encoder"
backend: "python"
max_batch_size: 0

input [
  {
    name: "text_encoder_input"
    data_type: TYPE_STRING
    dims: [1]
  }
]
output [
  {
    name: "text_encoder_output"
    data_type: TYPE_FP32
    dims: [768]
  }
]
